Revit 2020 API
ConnectionResolution Enumeration
 An enumerated type listing all the possible resolutions for connectivity validation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2016
Since: 2016
Syntax
C#
public enum ConnectionResolution
Visual Basic
Public Enumeration ConnectionResolution
Visual C++
public enum class ConnectionResolution
Members
Member name | Description
Disconnected |  Value for parts were disconnected.
See Also
Autodesk.Revit.DB Namespace